<?php
/**
 * 主配置文件
 * 调用方式：Yii::app()->controller->module['xxx']
 */
return array(
    'admin' => array(
        'list_count' => 50, // 默认后台列表展示条数
    ),
    'front' => array(
        'category_list_count' => 50, // 分类页展示条数
        'seo' => array(
            '标题' => array(
                '分类页' => "{分类名}_{站点名}",
                '小说页' => "{小说名}_{分类名}_{站点名}",
                '章节页' => "{章节名}_{小说名}_{分类名}_{站点名}",
            ),
            "关键字" => array(
                '分类页' => "{分类关键字}",
                '小说页' => "{小说关键字}",
                '章节页' => "{小说名},{章节名}",
            ),
            "描述" => array(
                '分类页' => "{分类描述}",
                '小说页' => "{小说简介}",
                '章节页' => "{站点名}提供了{小说作者}创作的都市小说《{小说名}》干净清爽无错字的文字章节：{章节名}在线阅读。",
            ),
        )
    ),
);